---
kind: method
id: M:Autodesk.Revit.DB.ColorFillScheme.SortEntries
source: html/b1cec6a3-6b60-b47f-2ea6-a6d7df9555c0.htm
---
# Autodesk.Revit.DB.ColorFillScheme.SortEntries Method

Sorts the scheme entries ascending.

## Syntax (C#)
```csharp
public void SortEntries()
```

## Remarks
If the scheme parameter value storage type is ElementId, then
 the order of entries would be based on the name of the elements.